Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The `lv_example_3dtexture <https://github.com/lvgl/lv_example_3dtexture>` repository is a demonstration of how to use the ``3dtexture`` widget to load glTF models with OpenGL and display them in LVGL.
it_it: Il repository `lv_example_3dtexture <https://github.com/lvgl/lv_example_3dtexture>` è una dimostrazione di come utilizzare il widget ``3dtexture`` per caricare modelli glTF con OpenGL e visualizzarli in LVGL.

source: The `lv_port_linux <https://github.com/lvgl/lv_port_linux>`__ project is typically meant to be used for embedded hardware, but it runs perfectly on PC as well.
it_it: Il progetto `lv_port_linux <https://github.com/lvgl/lv_port_linux>`__ è in genere pensato per l'uso su hardware embedded, ma funziona perfettamente anche su PC.

source: The `lv_web_emscripten <https://github.com/lvgl/lv_web_emscripten>`__ project provides a ready-to-use setup for compiling any LVGL UI into a browser-capable HTML file.
it_it: Il progetto `lv_web_emscripten <https://github.com/lvgl/lv_web_emscripten>`__ fornisce una configurazione pronta all'uso per compilare qualsiasi interfaccia utente LVGL in un file HTML compatibile con il browser.

source: The `reference project <https://github.com/lvgl/lv_port_linux/>`__ uses CMakeLists to generate the necessary dependencies at build time.
it_it: Il `progetto di riferimento <https://github.com/lvgl/lv_port_linux/>`__ usa CMakeLists per generare le dipendenze necessarie in fase di compilazione.

source: The `slowdown` parameter controls playback speed:
it_it: Il parametro `slowdown` controlla la velocità di riproduzione:

source: The `x1` and `y1` coordinates are rounded down, while the `x2` and `y2` coordinates are rounded up.
it_it: Le coordinate `x1` e `y1` vengono arrotondate per difetto, mentre `x2` e `y2` vengono arrotondate per eccesso.

source: The above uses Windows paths as an example.
it_it: Quanto sopra usa i path Windows come esempio.

source: The above website is a good place to start, as is the ``README`` file in the top directory of the version you downloaded.
it_it: Il sito web sopra indicato è un buon punto di partenza, così come il file ``README`` nella directory principale della versione scaricata.

source: The action of subscribing to a Subject:
it_it: L'azione di iscrizione a un Subject:

source: The actions taken might to open the file, display it, send it to some other part of the application, etc..
it_it: Le azioni intraprese potrebbero aprire il file, visualizzarlo, inviarlo a un'altra parte dell'applicazione, ecc.

source: The actual directory depends on several things:
it_it: La directory effettiva dipende da diversi fattori:

source: The actual values of the enum fields are not important during code export as only the names are used and resolved by the compiler.
it_it: I valori effettivi dei campi enum non sono importanti durante l'esportazione del codice, poiché solo i nomi vengono utilizzati e risolti dal compilatore.

source: The address is displayed in the bottom right corner.
it_it: L'indirizzo viene visualizzato nell'angolo in basso a destra.

source: The advantage of using an EVE chip is that the rendering responsibility is removed from the driving MCU so it can be a lower-spec part or dedicate more of its processing time to other tasks.
it_it: Il vantaggio di utilizzare un chip EVE è che la responsabilità del rendering viene rimossa dalla MCU di controllo, che può quindi essere un componente con specifiche inferiori o dedicare più tempo di elaborazione ad altre attività.

source: The algorithm simply counts how many repeated pixels with the same color there are, and stores the count value and the color value.
it_it: L'algoritmo conta semplicemente quanti pixel ripetuti con lo stesso colore ci sono e memorizza il valore del conteggio e il valore del colore.

source: The angle values should be in the range [0..360].
it_it: I valori degli angoli devono essere compresi tra [0 e 360].

source: The animation image is similar to the normal 'Image' Widget.
it_it: L'immagine di animazione è simile al normale Widget 'Image'.

source: The animation parameters are widget specific, e.g. animation time could be the E.g. blink time of the cursor on the Text Area or scroll time of a roller.
it_it: I parametri di animazione sono specifici del widget, il tempo di animazione potrebbe essere, ad esempio, il tempo di lampeggìo del cursore sull'area di testo o il tempo di scorrimento di un roller.

source: The animations are rendered in ARGB8888 format, therefore the buffer's size should be equal to ``target_width x target_height x 4`` bytes.
it_it: Le animazioni vengono renderizzate in formato ARGB8888, pertanto la dimensione del buffer deve essere pari a ``target_width x target_height x 4`` byte.

source: The animations can be downloaded from various sources, such as `https://lottiefiles.com/ <https://lottiefiles.com/>`__ or you can create your own animations using, for example, Adobe After Effects.
it_it: Le animazioni possono essere scaricate da diverse fonti, come `https://lottiefiles.com/ <https://lottiefiles.com/>`__ oppure se ne possono creare di proprie, ad esempio, utilizzando Adobe After Effects.

source: The appearance of the text and the arc can be customized using typical text and background style properties.
it_it: L'aspetto del testo e dell'arco può essere personalizzato utilizzando le tipiche proprietà di stile del testo e dello sfondo.

source: The application is configured to run on fbdev.
it_it: L'applicazione è configurata per essere eseguita su fbdev.

source: The area can be freely modified if needed to adapt it a special requirement of the display.
it_it: L'area può essere modificata liberamente se necessario per adattarla a un requisito specifico del display.

source: The arrangement order of each pinyin syllable is very important.
it_it: L'ordine di disposizione di ogni sillaba pinyin è molto importante.

source: The available flags are:
it_it: I flag disponibili sono:

source: The available machine configurations for Raspberrypi can be listed like this
it_it: Le configurazioni macchina disponibili per RaspberryPi possono essere elencate in questo modo:

source: The available space will be distributed among items respective to their grow value (larger value means more space)
it_it: Lo spazio disponibile verrà distribuito tra gli elementi in base al loro valore di crescita (un valore maggiore significa più spazio)

source: The basic idea is that we have ``void * user_data`` field that is used automatically by the MicroPython Binding to save the *MicroPython callable object* for a callback.
it_it: L'idea di base è che abbiamo un campo ``void * user_data`` che viene utilizzato automaticamente dal binding MicroPython per salvare l'*oggetto richiamabile MicroPython* per una callback.

source: The below are some rules to follow when updating any of the .rst files located in the ./docs/src/ directory tree.
it_it: Di seguito sono riportate alcune regole da seguire quando si aggiorna uno qualsiasi dei file .rst presenti nella directory ./docs/src/.

source: The below code example assumes the image was opened using the decoder interface (e.g. using :ref:`libpng` and thus has already called :cpp:func:`lv_image_decoder_post_process` to perform stride alignment and/or premultiplication via the decoder descriptor's ``args`` field).
it_it: L'esempio di codice seguente presuppone che l'immagine sia stata aperta utilizzando l'interfaccia del decoder (ad esempio, utilizzando :ref:`libpng` e quindi abbia già chiamato :cpp:func:`lv_image_decoder_post_process` per eseguire lo "stride alignment" e/o la premoltiplicazione tramite il campo ``args`` del descrittore del decoder).

source: The below code snippet demonstrates correct use of :cpp:func:`lv_snapshot_take`:
it_it: Il frammento di codice seguente mostra l'uso corretto di :cpp:func:`lv_snapshot_take`:

source: The below statistics are from a watch project.
it_it: Le statistiche seguenti provengono da un progetto di orologio.

source: The best way to think about NuttX is to think of it as a small Unix/Linux for microcontrollers.
it_it: Il modo migliore per pensare a NuttX è considerarlo come un piccolo Unix/Linux per microcontrollori.

source: The bit order of the resulting vtiled buffer can be specified using the `bit_order_lsb` parameter.
it_it: L'ordine dei bit del buffer vtiled risultante può essere specificato utilizzando il parametro `bit_order_lsb`.

source: The bitmap itself will be embedded into the TTF as well.
it_it: Anche la bitmap stessa verrà incorporata nel TTF.

source: The board image contains LVGL and lv_drivers as dynamically linkable libraries.
it_it: L'immagine della board contiene LVGL e lv_drivers come librerie linkabili dinamicamente.

source: The border is drawn **inside** the bounding box, and padding is applied **inside** the border.
it_it: Il bordo viene disegnato **all'interno** del "bounding box" [riquadro di delimitazione] e la spaziatura interna viene applicata **all'interno** del bordo.

source: The buffer can be set with either :cpp:expr:`lv_lottie_set_buffer(lottie, w, h, buf)` or :cpp:expr:`lv_lottie_set_draw_buf(lottie, draw_buf)`.
it_it: Il buffer può essere impostato con :cpp:expr:`lv_lottie_set_buffer(lottie, w, h, buf)` o :cpp:expr:`lv_lottie_set_draw_buf(lottie, draw_buf)`.

source: The buffer for a layer (where rendering occurs) is not allocated at creation.
it_it: Il buffer per un layer (dove avviene il rendering) non viene allocato al momento della creazione.

source: The buffer size for a chunk is set using :c:macro:`LV_DRAW_LAYER_SIMPLE_BUF_SIZE` in ``lv_conf.h``.
it_it: La dimensione del buffer per un blocco viene impostata tramite :c:macro:`LV_DRAW_LAYER_SIMPLE_BUF_SIZE` in ``lv_conf.h``.

source: The buffer you pass to :cpp:func:`lv_label_set_text_static` must be writable if you plan to use :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS`.
it_it: Il buffer che si passa a :cpp:func:`lv_label_set_text_static` deve essere scrivibile se si intende utilizzare :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS`.

source: The build system defaults to using separate directories for gcc and some kernel recipes.
it_it: Il sistema di build utilizza per default directory separate per gcc e alcune ricette del kernel.

source: The build system uses the task input checksums along with the stamp and shared state cache mechanisms.
it_it: Il sistema di build utilizza i checksum di input dei task insieme ai meccanismi di "stamp" [timbro] e cache di stato condivisa.

source: The building blocks of the message box can be obtained using the following functions:
it_it: I componenti costitutivi della finestra di messaggio possono essere ottenuti utilizzando le seguenti funzioni:

source: The built-in LVGL widgets (e.g., :ref:`lv_slider`, :ref:`lv_label`, :ref:`lv_chart`, etc.) already have XML parsers and are therefore available in XML.
it_it: I widget LVGL natuvu (ad esempio, :ref:`lv_slider`, :ref:`lv_label`, :ref:`lv_chart`, ecc.) dispongono già di parser XML e sono quindi disponibili in XML.

source: The built-in decoder understands all the formats in :ref:`images_color_formats` minus the ``RAW`` formats.
it_it: Il decoder nativo riconosce tutti i formati in :ref:`images_color_formats`, ad eccezione dei formati ``RAW``.

source: The built-in font engine is also the easiest to use:
it_it: Il "font engine" integrato è anche il più semplice da usare:

source: The built-in font engine supports compressed bitmaps.
it_it: Il motore integrato dei font supporta bitmap compresse.

source: The built-in fonts are **global variables** with names like :cpp:var:`lv_font_montserrat_16` for a 16 px height font.
it_it: I font integrati sono **variabili globali** con nomi come :cpp:var:`lv_font_montserrat_16` per un font di 16 px di altezza.

source: The built-in fonts with ``bpp = 4`` contain the ASCII characters and use the `Montserrat <https://fonts.google.com/specimen/Montserrat>`__ font.
it_it: I font predefiniti con ``bpp = 4`` contengono i caratteri ASCII e utilizzano il font `Montserrat <https://fonts.google.com/specimen/Montserrat>`__.

source: The built-in thesaurus is customized based on the **LV_FONT_SOURCE_HAN_SANS_SC_16_CJK** font library, which currently has more than 1,000 of the most common CJK radicals, so it is recommended to use a custom font and thesaurus.
it_it: Il thesaurus integrato è personalizzato in base alla libreria di font **LV_FONT_SOURCE_HAN_SANS_SC_16_CJK**, che attualmente include più di 1.000 dei radicali CJK più comuni quindi si consiglia di utilizzare un font e un thesaurus personalizzati.

source: The built-in widgets consist of:
it_it: I widget nativi sono costituiti da:

source: The button goes to :cpp:enumerator:`LV_STATE_CHECKED` when it's opened.
it_it: Il pulsante passa a :cpp:enumerator:`LV_STATE_CHECKED` quando viene aperto.

source: The buttons' width can be set in proportion to the width of other buttons in the same row with :cpp:expr:`lv_buttonmatrix_set_button_width(btn_matrix, button_id, width)` E.g. in a line with two buttons: *buttonA, width = 1* and *buttonB, width = 2*, *buttonA* will have 33 % width and *buttonB* will have 66 % width.
it_it: La larghezza dei pulsanti può essere impostata in proporzione alla larghezza degli altri pulsanti nella stessa riga con :cpp:expr:`lv_buttonmatrix_set_button_width(btn_matrix, button_id, width)`. Ad esempio, in una riga con due pulsanti: *buttonA, width = 1* e *buttonB, width = 2*, *buttonA* avrà una larghezza pari al 33% e *buttonB* una larghezza pari al 66%.

source: The cache should be sufficiently large or disabled in that case.
it_it: In tal caso, la cache dovrebbe essere sufficientemente grande o disabilitata.

source: The cache size is indicated in number of entries.
it_it: La dimensione della cache è indicata in numero di voci.

source: The calendar Widget uses the :ref:`Button Matrix <lv_buttonmatrix>` Widget under the hood to arrange the days into a matrix.
it_it: Il Widget Calendar utilizza il :ref:`Button Matrix <lv_buttonmatrix>` per organizzare i giorni in una matrice.

source: The callback :cpp:type:`lv_imgfont_get_path_cb_t` also receives the ``user_data`` as the last argument.
it_it: Anche la callback :cpp:type:`lv_imgfont_get_path_cb_t` riceve ``user_data`` come ultimo argomento.

source: The callback itself receives ``void *`` as the **last** argument
it_it: La callback stessa riceve ``void *`` come **ultimo** argomento

source: The callback need not call :cpp:func:`lv_display_flush_ready` since the caller takes care of that (clearing the display's ``flushing`` flag) when your callback returns.
it_it: La callback non deve necessariamente chiamare :cpp:func:`lv_display_flush_ready`, poiché il chiamante se ne occupa (cancellando il flag ``flushing`` del display) al termine della callback.

source: The callback receives an array of available modes and must return the index of the desired mode.
it_it: La callback riceve un array di modalità disponibili e deve restituire l'indice della modalità desiderata.

source: The callback should follow the standard LVGL event callback signature: ``void an_event_handler(lv_event_t * e);``
it_it: La callback deve seguire la firma standard LVGL per le callback di eventi: ``void an_event_handler(lv_event_t * e);``

source: The callback should have this prototype: ``void (*lv_timer_handler_resume_cb_t)(void*)``.
it_it: La callback dovrebbe avere questo prototipo: ``void (*lv_timer_handler_resume_cb_t)(void*)``.

source: The cast to ``lv_obj_flag_t`` is required in C++ due to stricter type checking, but is optional in C.
it_it: Il cast a ``lv_obj_flag_t`` è obbligatorio in C++ a causa del controllo di tipo più rigoroso, ma è facoltativo in C.

source: The changes are recorded in :ref:`changelog`.
it_it: Le modifiche sono loggatevengono scritte nei :ref:`changelog`.

source: The chart's background (with optional division lines)
it_it: Lo sfondo del grafico (con linee di divisione opzionali)

source: The children of a Widget can be snapped according to specific rules when scrolling ends.
it_it: I figli di un Widget possono essere agganciati secondo regole specifiche al termine dello scorrimento.

source: The clock source is selectable from internal or external (LCD_EXTCLK)
it_it: La sorgente di clock è selezionabile tra interna o esterna (LCD_EXTCLK).

source: The code files that contain the logic for those subsystems are often arranged so that there is an ``#if <ENABLING_MACRO_NAME>`` directive near the top of the file, and its matching ``#endif`` is at the end of the file.
it_it: I file di codice che contengono la logica per tali sottosistemi sono spesso organizzati in modo che vi sia una direttiva ``#if <ENABLING_MACRO_NAME>`` all'inizio del file e la sua corrispondente ``#endif`` alla fine.

source: The code should show clearly what you are doing.
it_it: Il codice dovrebbe mostrare chiaramente cosa si sta facendo.

source: The color format is stored in the ``header.cf`` field of the :cpp:type:`lv_image_dsc_t` struct.
it_it: Il formato del colore è memorizzato nel campo ``header.cf`` della struct :cpp:type:`lv_image_dsc_t`.

source: The color format of the buffer and Canvas need to match.
it_it: Il formato colore del buffer e del Canvas devono corrispondere.

source: The color format of the created LVGL display will match the LTDC layer's color format.
it_it: Il formato colore del display LVGL creato corrisponderà al formato colore del layer LTDC.

source: The color module handles all color-related functions like changing color depth, creating colors from hex code, converting between color depths, mixing colors, etc.
it_it: Il modulo colore gestisce tutte le funzioni relative al colore, come la modifica della profondità di colore, la creazione di colori da codice esadecimale, la conversione tra profondità di colore, la miscelazione dei colori, ecc.

source: The color to mix is set by ``img_recolor``.
it_it: Il colore da miscelare è impostato da ``img_recolor``.

source: The columns will be placed from right to left.
it_it: Le colonne verranno posizionate da destra a sinistra.

source: The combination of these enable you to efficiently develop UIs without having to re-invent the wheel.
it_it: La combinazione di questi elementi consente di sviluppare interfacce utente in modo efficiente senza dover reinventare la ruota.

source: The commands must be put into a 'uint8_t' array:
it_it: I comandi devono essere inseriti in un array di 'uint8_t':

source: The comments in ``lv_conf.h`` explain the meaning of each setting.
it_it: I commenti in ``lv_conf.h`` spiegano il significato di ciascuna impostazione.

source: The commit messages format is inspired by `Angular Commit Format <https://github.com/angular/angular/blob/main/CONTRIBUTING.md#commit>`__.
it_it: Il formato dei messaggi di commit si ispira all'`Angular Commit Format <https://github.com/angular/angular/blob/main/CONTRIBUTING.md#commit>`__.

source: The common component of these projects is the ``.ioc`` file.
it_it: Il componente comune di questi progetti è il file ``.ioc``.

source: The compiler must be activated in e\ |sup2| studio:
it_it: Il compilatore deve essere attivato in e\ |sup2| studio:

source: The complete graphic framework includes a variety of widgets for you to use in the creation of your GUI, and supports more advanced functions such as animations and anti-aliasing.
it_it: Il framework grafico completo include una varietà di widget da utilizzare nella creazione della GUI e supporta funzioni più avanzate come animazioni e anti-aliasing.

source: The completion status of draw task will be sent to the main LVGL thread asynchronously.
it_it: Lo stato di completamento dell'attività di disegno verrà inviato al thread LVGL principale in modo asincrono.

source: The components will be available via code generation, including the entry point in *"main.c"*.
it_it: I componenti saranno disponibili tramite la generazione di codice, incluso il punto di ingresso in *"main.c"*.

source: The components will be available via code generation, including the entry point of the application.
it_it: I componenti saranno disponibili tramite la generazione di codice, incluso il punto di ingresso dell'applicazione.

source: The concept in a nutshell is that a style is an :cpp:type:`lv_style_t` variable which can hold properties like border width, font, text color and so on.
it_it: Il concetto, in breve, è che uno stile è una variabile :cpp:type:`lv_style_t` che può contenere proprietà come lo spessore del bordo, il font, il colore del testo e così via.

source: The configuration files (``.conf``) define various configuration variables that govern the OpenEmbedded build process.
it_it: I file di configurazione (``.conf``) definiscono diverse variabili di configurazione che governano il processo di compilazione di OpenEmbedded.

source: The configured LVGL color format is probably not compatible with your display's color format.
it_it: Il formato colore LVGL configurato, probabilmente, non è compatibile con il formato colore del display.

source: The conic gradient is defined between two angles within a circle, and colors are mapped to each angle.
it_it: Il gradiente conico è definito tra gli angoli all'interno di un cerchio e i colori sono mappati a ciascun angolo.

source: The constantly evolving OpenGL driver in LVGL has proven to be the most performant driver in at least one case and can be used wherever the prerequisites are satisfied.
it_it: Il driver OpenGL in continua evoluzione in LVGL ha dimostrato di essere il driver più performante in almeno un caso e può essere utilizzato ovunque siano soddisfatti i prerequisiti.

source: The container running the LVGL application needs access to the framebuffer device ``/dev/fb0``.
it_it: Il container che esegue l'applicazione LVGL necessita di accesso al framebuffer ``/dev/fb0`` del dispositivo.

source: The content area (bounding box minus border and padding).
it_it: Area del contenuto ("bounding box" meno bordo e padding interno).

source: The content area is smaller due to padding and border width.
it_it: L'area del contenuto è più piccola a causa della spaziatura interna e della larghezza del bordo.

source: The content of ``recipes-lvglapp/lvgl-fbdev-benchmark/lvglbenchmarkfbdev_2.4.bb``
it_it: Il contenuto di ``recipes-lvglapp/lvgl-fbdev-benchmark/lvglbenchmarkfbdev_2.4.bb``

source: The content of the buffers pointed to need to remain valid for the life of the Scale.
it_it: Il contenuto dei buffer a cui si punta deve rimanere valido per tutta la durata della Scale.

source: The contents of the buffer passed must be survive long enough for the call to `lv_timer_handler()` that is driving the event to return (after which the Text Area's label will have copied the text).
it_it: Il contenuto del buffer passato deve sopravvivere abbastanza a lungo da consentire il ritorno della chiamata a `lv_timer_handler()` che gestisce l'evento (dopodiché l'etichetta dell'area di testo avrà copiato il testo).

source: The contents of the output file is a large JSON object (``{...}``) with the following key/value pairs (these are the keys):
it_it: Il contenuto del file di output è un oggetto JSON di grandi dimensioni (``{...}``) con le seguenti coppie chiave/valore (queste sono le chiavi):

source: The conversion is supported from the following formats (i.e., the test display should have a color format in this list):
it_it: La conversione è supportata dai seguenti formati (ad esempio, la visualizzazione di test dovrebbe avere un formato colore in questo elenco):

source: The core functionality requires only a few lines.
it_it: Le funzionalità principali richiedono solo poche righe.

source: The core repositories follow the rules of `Semantic Versioning <https://semver.org/>`__:
it_it: I repository principali seguono le regole del `Semantic Versioning <https://semver.org/>`__:
